# Напишите программу, которая считывает целые числа с консоли, по одному числу в строке.
# Для каждого входного числа вы должны проверить:

# если число меньше 10, то пропустите это число;
# если число больше 100, перестать читать числа из консоли;
# в других случаях выведите это число обратно в консоль в отдельной строке.

# Sample Input 1:
# 12
# 4
# 2
# 58
# 112
# Sample Output 1:
# 12
# 58

# Sample Input 2:
# 101
# Sample Output 2:

# Sample Input 3:
# 1
# 2
# 102
# Sample Output 3:


