# В фермерской игре вы можете покупать определенных животных по определенной цене.
# Как игрок, вы хотите купить самое полезное (то есть самое дорогое) животное. Вот животные и их цены:

# Item: Price
# Сhicken: 23
# Goat: 678
# Pig: 1296
# Cow: 3848
# Sheep: 6769

# Напишите программу, которая определяет самое дорогое животное, которое пользователь может купить за свои деньги,
# и сколько из них он может купить.
# Обратите внимание, что вы должны найти для покупки только один вид животных (самый дорогой).
# Никаких альтернативных вариантов упоминать не нужно. Например, если у пользователя 710 монет,
# ваша программа должна выводить 1 козу, а не 1 козу \ n30 цыплят или что-то в этом роде.

# Формат ввода:
# Деньги, которые есть у пользователя.

# Формат вывода:
# Сколько животных может позволить себе пользователь, например, 20 кур.
# Если пользователь не может позволить себе какое-либо животное, напишите «None».
# Обратите внимание на количество существительных. Также имейте в виду, что слово «sheep» имеет неправильную форму
# множественного числа «sheep».

# Sample Input 1:
# 680
# Sample Output 1:
# 1 goat

# Sample Input 2:
# 8
# Sample Output 2:
# None

# Sample Input 3:
# 668
# Sample Output 3:
# 29 chickens
