# Поскольку мы изучаем Python, иногда может быть полезно преобразовать текст из lowerCamelCase в snake_case.
# Основная хитрость - найти правильное место для вставки символа подчеркивания. Давайте сделаем правило, что оно стоит
# перед заглавной буквой следующего слова. Если первая буква заглавная, преобразуйте ее в нижний регистр,
# но не вставляйте перед ней подчеркивание.

# Формат ввода:
# Прочтите слово или фразу, написанную нижним регистром.

# Формат вывода:
# Распечатайте слова в нижнем регистре и разделите их подчеркиванием.

# Sample Input 1:
# python

# Sample Output 1:
# python

# Sample Input 2:
# parselTongue
# Sample Output 2:
# parsel_tongue


