# Напишите программу, которая считывает целые числа с консоли (по одному в строке), пока их сумма не станет равной 0.
# Сразу после этого она должна отображать сумму квадратов всех введенных чисел.

# Гарантируется, что в какой-то момент сумма введенных чисел будет равна 0. После этого следует прекратить чтение ввода.
# Если первое целое число равно 0, просто выведите 0 вместо суммы квадратов.
# Сумму квадратов нужно вывести только один раз.

# Sample Input 1:
# 1
# -3
# 5
# -6
# -10
# 13
# 4
# -8
# Sample Output 1:
# 340

