# В прогрессивных налоговых системах налоговые ставки меняются в зависимости от дохода. Н
# алоговые группы - это подразделения, которые регулируют эти изменения.

# Вот пример налоговых скобок в определенной налоговой системе:

# 0 - 15 527: 0% налог
# 15 528 - 42 707: налог 15%
# 42 708 - 132 406: налог в размере 25%
# 132 407 и более: налог 28%

# Предположим, мы используем упрощенную версию налогообложения и применяем одну налоговую ставку ко всей сумме денег.
# Напишите программу, которая рассчитывает налог, который человек собирается платить, исходя из его дохода.

# Формат ввода:
# Стоимость чьего-либо налогооблагаемого дохода (в долларах).

# Формат вывода:
# Налог на {доход} составляет {процент}%. Это {рассчитанный_ налог} долларов!
# Округлите расчетный_ налог до ближайшего целого числа.

# Sample Input 1:
# 14378
# Sample Output 1:
# The tax for 14378 is 0%. That is 0 dollars!

# Sample Input 2:
# 99999
# Sample Output 2:
# The tax for 99999 is 25%. That is 25000 dollars!


