# Вывод должен быть удобным для пользователя, но важна и часть кода.
# Хорошо структурированный и читаемый код очень важен для хорошего программиста.
# Теперь вам решать, какой метод форматирования выбрать.

# Представьте, что вам нужно составить динамический URL-адрес для каждого конкретного пользователя с индивидуальной информацией.
# Предположим, вы хотите отправлять разные URL-адреса каждому пользователю в зависимости от его имени и профессии.
# База будет что-то вроде

# «http://example.com/*nickname*/deshibited/*profession*/profile»,
# где nickname и profession вводятся пользователем и являются динамическими.

# Считайте псевдоним и профессию пользователя из введенных данных и распечатайте URL-адрес пользователя.
# Не беспокойтесь о каких-либо правилах составления URL-адресов и просто используйте необработанный ввод для выполнения задачи.

# Sample Input 1:
# raybeam
# cereal-killer

#Sample Output 1:
# http://example.com/raybeam/desirable/cereal-killer/profile

# Sample Input 2:
# AnnMelon
# bodybuilder

# Sample Output 2:
# http://example.com/AnnMelon/desirable/bodybuilder/profile



